# MajorSegmentIndex Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeDefinitionBySegments..::..MajorSegmentIndex Property
RebarShapeDefinitionBySegments Class See Also
---
Index of a segment that can be considered the most important. Revit attempts to preserve the orientation of this segment when a Rebar instance changes its RebarShape to one with a different number of segments.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public int MajorSegmentIndex { get; set; }
```

Visual Basic
---
```text
Public Property MajorSegmentIndex As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int MajorSegmentIndex {
	int get ();
	void set (int value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: majorSegmentIndex is not between 0 and NumberOfSegments. |

# See Also
RebarShapeDefinitionBySegments Class
Autodesk.Revit.DB.Structure Namespace